mdmfile/src/Catalogs/мдмТочкиВложенныйПроцесс/мдмТочкиВложенныйПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиВложенныйПроцесс</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>БизнесПроцесс</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередСозданиемЗадач</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриСозданииЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередСозданиемБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриСозданииБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередВыполнением</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриВыполнении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбъекта</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Входы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выходы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиВложенныйПроцесс/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодсказок();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПередСозданиемЗадач.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до создания задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект создаваемой задачи.
					|		СтандартнаяОбработка - Булево - признак стандартного 
					|		поведения создания задачи.'")	
		);
		
	Элементы.ПриСозданииЗадачи.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после создания задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект созданной задачи.'")	
		);
		
	Элементы.ПередСозданиемБизнесПроцесса.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до создания задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		ФормируемыйБизнесПроцесс - БизнесПроцессОбъект.мдмПроцессОбработки - объект создаваемого бизнес-процесса.
					|		СтандартнаяОбработка - Булево - признак стандартного 
					|		поведения создания задачи.'")	
		);
		
	Элементы.ПриСозданииБизнесПроцесса.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после создания задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		ФормируемыйБизнесПроцесс - БизнесПроцессОбъект.мдмПроцессОбработки - объект созданного бизнес-процесса.'")	
		);
		
	Элементы.ПередВыполнением.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполняемой задачи.'")	
		);
		
	Элементы.ПриВыполнении.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполненной задачи.'")	
		);
		
КонецПроцедуры
